modify_simulation/modify_data_simulation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>"Test after modifying functions to simulate data in HMTree package"</title>
<!-- 2016-03-27 Sun 15:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Heejung Shim" />
</head>
<body>
<div id="content">
<h1 class="title">"Test after modifying functions to simulate data in HMTree package"</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Modify simulate.data function</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Modify simulate.data function</h2>
<div class="outline-text-2" id="text-1">
<p>
Let's check if modification doe not change outputs. 
</p>
<div class="org-src-container">

<pre class="src src-R">path.HMTree.package = "/home/hjshim/d/hjshim/software/HMTree/"
## read all functions
source(paste0(path.HMTree.package, "R/doppler.f.R"))
source(paste0(path.HMTree.package, "R/heaviside.f.R"))
source(paste0(path.HMTree.package, "R/spike.f.R"))
source(paste0(path.HMTree.package, "R/simulate_true_curve.R"))
source(paste0(path.HMTree.package, "R/simulate_noisy_curve.R"))
## read simulate.data function 
source(paste0(path.HMTree.package, "R/simulate.data.R"))

curve.length = 1024
model.mode = 'Poisson' 
num.groups=1
num.samples=10
WHMT.sigma=0.5
plotfn=FALSE

set.seed(666)
res.pois = simulate.data(curve.length=curve.length, model.mode=model.mode, num.groups=num.groups,num.samples=num.samples, WHMT.sigma=WHMT.sigma,plotfn=plotfn)
str(res.pois)
## List of 4
## $ lambda_vec     : num [1:1024] 58.3 57.7 57.1 56.5 55.9 ...
## $ lambda_diff_vec: num [1:1024] 0 0 0 0 0 0 0 0 0 0 ...
## $ data           : num [1:10, 1:1024] 63 66 63 62 50 52 55 71 57 55 ...
## $ data_mean      : num [1:1024] 59.4 60.5 58.7 59.7 55.5 53.3 52.1 52.5 51.6 54.5 ...

curve.length = 1024
model.mode = 'Normal' 
num.groups=1
num.samples=10
WHMT.sigma=0.5
plotfn=FALSE
 
set.seed(666) 
res.normal = simulate.data(curve.length=curve.length, model.mode=model.mode, num.groups=num.groups,num.samples=num.samples, WHMT.sigma=WHMT.sigma,plotfn=plotfn)
str(res.normal)
##List of 4
## $ lambda_vec     : num [1:1024] 58.3 57.7 57.1 56.5 55.9 ...
## $ lambda_diff_vec: num [1:1024] 0 0 0 0 0 0 0 0 0 0 ...
## $ data           : num [1:1024] 58.6 58.7 56.9 57.5 54.8 ...
## $ data_mean      : num [1:1024] 58.6 58.7 56.9 57.5 54.8 ...

#######################################################
## let's compare those outputs with files Or generated.
#######################################################
### You need to modify the following two lines.
setwd('/home/hjshim/d/hjshim/projects/HMTprior/HMTree_test/')
hmt.repodir.path = scan('.hmt.repodir.txt', what="")

pois.true = as.numeric(t(read.table(paste0(hmt.repodir.path, "data/sim/test_hmt_poiss.true.txt"))))
pois.mean = as.numeric(t(read.table(paste0(hmt.repodir.path, "data/sim/test_hmt_poiss.noisy.txt"))))
pois.data = t(read.table(paste0(hmt.repodir.path, "data/sim/test_hmt_poiss.individual.noisy.txt")))

normal.true = as.numeric(t(read.table(paste0(hmt.repodir.path, "data/sim/test_hmt_gaussian.true.txt"))))
normal.mean = as.numeric(t(read.table(paste0(hmt.repodir.path, "data/sim/test_hmt_gaussian.noisy.txt"))))

sum(abs(res.pois$lambda_vec - pois.true) &lt; 0.001)
sum(abs(res.pois$data_mean - pois.mean) &lt; 0.001)
sum(abs(res.pois$data - pois.data) &lt; 0.001)
## [1] 1024
## [1] 1024
## [1] 10240

sum(abs(res.normal$lambda_vec - normal.true) &lt; 0.001)
sum(abs(res.normal$data_mean - normal.mean) &lt; 0.001)
sum(abs(res.normal$data - normal.mean) &lt; 0.001)
## [1] 1024
## [1] 1024
## [1] 1024
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Heejung Shim</p>
<p class="date">Created: 2016-03-27 Sun 15:12</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
